uhnp/src/InformationRegisters/ПротоколРасчетаСтруктурыЗаказа/ПротоколРасчетаСтруктурыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколРасчетаСтруктурыЗаказа</name>
  <resources>
    <name>Протокол</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируетРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.ТипыОшибокРасчетаСтруктурыЗаказаНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДеньРегистрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОшибки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПротоколРасчетаСтруктурыЗаказа/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторОшибки", Запись.ИдентификаторОшибки);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ошибки.Протокол КАК Протокол
	|ИЗ
	|	РегистрСведений.ПротоколРасчетаСтруктурыЗаказа КАК Ошибки
	|ГДЕ
	|	Ошибки.ИдентификаторОшибки = &ИдентификаторОшибки
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураИзХранилища = Неопределено;
	
	Если Выборка.Следующий() Тогда
		ХранилищеПротокола = Выборка.Протокол; //ХранилищеЗначения
		СтруктураИзХранилища = ХранилищеПротокола.Получить();
	КонецЕсли;
	
	Если ТипЗнч(СтруктураИзХранилища) = Тип("Структура") Тогда
		
		СтруктураПротокола = РегистрыСведений.ПротоколРасчетаСтруктурыЗаказа.ПротоколМакет();
		ЗаполнитьЗначенияСвойств(СтруктураПротокола, СтруктураИзХранилища);
		ТекстСообщения = СтруктураПротокола.ТекстСообщения;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

#КонецОбласти
